test/nexj/core/persistence/sql/data/readPolymorphic.xml


<!-- Copyright 2010 NexJ Systems Inc. This software is licensed under the terms of the Eclipse Public License 1.0 -->
<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[6]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
            <Item href="#d"/>
            <Item href="#e"/>
            <Item href="#f"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>UserTemplate</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABg==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[2]">
            <Item>typeCode</Item>
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:string">T</Item>
            <Item xi:type="xs:string">Default</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>User</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAg==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[2]">
            <Item>typeCode</Item>
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:string">U</Item>
            <Item xi:type="xs:string">jsmith</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>User</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[2]">
            <Item>typeCode</Item>
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:string">U</Item>
            <Item xi:type="xs:string">jtest</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="d">
         <class>Group</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAAAw==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[2]">
            <Item>typeCode</Item>
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:string">G</Item>
            <Item xi:type="xs:string">QA</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="e">
         <class>SystemUserTemplate</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABQ==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[2]">
            <Item>typeCode</Item>
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:string">Y</Item>
            <Item xi:type="xs:string">SystemUser</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="f">
         <class>Group</class>
         <version>0</version>
         <oid>
            <values nc:arrayType="xs:anyType[1]">
               <Item xi:type="xs:base64Binary">AAAAAAAAAAAAAAAAAAAABA==</Item>
            </values>
         </oid>
         <keys nc:arrayType="xs:string[2]">
            <Item>typeCode</Item>
            <Item>name</Item>
         </keys>
         <values nc:arrayType="xs:anyType[2]">
            <Item xi:type="xs:string">G</Item>
            <Item xi:type="xs:string">users</Item>
         </values>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
